Q1. What is data encoding? How is it useful in data science?

converting a sequence of text characters into binary code

transformation of categorical variables to binary or numerical counterparts

Q2. What is nominal encoding? Provide an example of how you would use it in a real-world scenario.

When we have a feature where variables are just names and there is no order or rank to this variable's feature.

In [1]:
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
from sklearn.preprocessing import OneHotEncoder

In [5]:
one = OneHotEncoder()

In [7]:
encoder = one.fit_transform(df[['who']])

In [10]:
encoder.toarray()

array([[0., 1., 0.],
       [0., 0., 1.],
       [0., 0., 1.],
       ...,
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 1., 0.]])

In [11]:
import pandas as pd

In [14]:
encoded_df = pd.DataFrame(encoder.toarray() , columns=one.get_feature_names_out())

In [15]:
encoded_df

     who_child  who_man  who_woman
0          0.0      1.0        0.0
1          0.0      0.0        1.0
2          0.0      0.0        1.0
3          0.0      0.0        1.0
4          0.0      1.0        0.0
..         ...      ...        ...
886        0.0      1.0        0.0
887        0.0      0.0        1.0
888        0.0      0.0        1.0
889        0.0      1.0        0.0
890        0.0      1.0        0.0

[891 rows x 3 columns]

Q3. In what situations is nominal encoding preferred over one-hot encoding? Provide a practical example.

In what situations is nominal encoding preferred over one-hot encoding --  when the catigorical data is given in very large ammount.

- Provide a practical example

- nominal encoding may be preferred over one-hot encoding is in the analysis of survey data where the respondent is asked to indicate their level of agreement or disagreement with a statement on a Likert scale. Suppose there are five response options ranging from "Strongly Disagree" to "Strongly Agree." In this case, nominal encoding can assign values of 1 through 5 to each response option.

- one-hot encoding would require creating five binary variables, each corresponding to one response option. Using nominal encoding can reduce the number of variables needed in the analysis, making it more manageable and efficient.

Q4. Suppose you have a dataset containing categorical data with 5 unique values. Which encoding
technique would you use to transform this data into a format suitable for machine learning algorithms?
Explain why you made this choice.

One-hot encoding creates a binary variable for each unique category in the dataset, where the variable is set to 1 if the observation belongs to that category and 0 otherwise. In the case of five unique values, this would result in five binary variables, making the resulting dataset more manageable for machine learning algorithms to handle.

Q5. In a machine learning project, you have a dataset with 1000 rows and 5 columns. Two of the columns
are categorical, and the remaining three columns are numerical. If you were to use nominal encoding to
transform the categorical data, how many new columns would be created? Show your calculations.

Let's assume that the first categorical variable has 4 unique categories, and the second categorical variable has 6 unique categories. Therefore, we will create 4 new columns for the first categorical variable and 6 new columns for the second categorical variable.

In total, we will create 4 + 6 = 10 new columns for the two categorical variables using nominal encoding.

Thus, the resulting dataset will have 1000 rows and 10 columns (3 original numerical columns + 4 new columns for the first categorical variable + 6 new columns for the second categorical variable).

Q6. You are working with a dataset containing information about different types of animals, including their
species, habitat, and diet. Which encoding technique would you use to transform the categorical data into
a format suitable for machine learning algorithms? Justify your answer.

In this scenario, nominal encoding can assign a unique numerical value to each species, habitat, and diet category, which can then be used as inputs to a machine learning algorithm. However, it is worth noting that nominal encoding is not always the best choice for categorical data, and other encoding techniques such as ordinal encoding or one-hot encoding may be more appropriate depending on the characteristics of the data and the requirements of the machine learning algorithm being used.

Q7.You are working on a project that involves predicting customer churn for a telecommunications
company. You have a dataset with 5 features, including the customer's gender, age, contract type,
monthly charges, and tenure. Which encoding technique(s) would you use to transform the categorical
data into numerical data? Provide a step-by-step explanation of how you would implement the encoding.

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({
    
    'gender' : ['male' , 'female' , 'male' , 'female' , 'male' , 'female' ] ,
    'age' : [55,44,66,88,75,41] ,
    'contract_type' : ['Month-to-month' , 'One-year contract' , 'Prepaid contract' , 'Month-to-month' , 'One-year contract' , 'Prepaid contract'] ,
    'monthly_charges' : [200,633,568,452,575,652],
    'tenure' : ['1_month' ,  '6_months' , '1_year' , '1_month' ,  '6_months' , '1_year']

})

In [6]:
df

   gender  age      contract_type  monthly_charges    tenure
0    male   55     Month-to-month              200   1_month
1  female   44  One-year contract              633  6_months
2    male   66   Prepaid contract              568    1_year
3  female   88     Month-to-month              452   1_month
4    male   75  One-year contract              575  6_months
5  female   41   Prepaid contract              652    1_year

In [7]:
from sklearn.preprocessing import OneHotEncoder

In [8]:
o = OneHotEncoder()

In [9]:
encoder = o.fit_transform(df[['gender' , 'contract_type' , 'tenure']])

In [11]:
encoder_df = pd.DataFrame(encoder.toarray() , columns= o.get_feature_names_out())

In [12]:
encoder_df

,gender_female,gender_male,contract_type_Month-to-month,contract_type_One-year contract,contract_type_Prepaid contract,tenure_1_month,tenure_1_year,tenure_6_months
0,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0
1,1.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0
2,0.0,1.0,0.0,0.0,1.0,0.0,1.0,0.0
3,1.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0
4,0.0,1.0,0.0,1.0,0.0,0.0,0.0,1.0
5,1.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0